{"pageProps":{"entry":{"title":"青空文庫の作品を目安の読了時間で検索できるサービス「ゾラサーチ」をリリースしました","slug":"2019/04/04/133409","excerpt":"![f:id:o_tomomichi:20190403115005p:plain](https://cdn-ak.f.st-hatena.com/images/fotolife/o/o_tomomichi/20190403/20190403115005.png \"f:id:o_tomomichi:20190403115005p:plain\")\n\nタイトルのまんまですが、また地味なサービスを作りました。 よかったら見てみてください。\n\n\\[2020.4.1追記\\]  \nサービス名を「ゾラサーチ」から「ブンゴウサーチ」に変更しました。\n\n[search.bungomail.com](http://search.bungomail.com/)","content":"![f:id:o_tomomichi:20190403115005p:plain](https://cdn-ak.f.st-hatena.com/images/fotolife/o/o_tomomichi/20190403/20190403115005.png \"f:id:o_tomomichi:20190403115005p:plain\")\n\nタイトルのまんまですが、また地味なサービスを作りました。 よかったら見てみてください。\n\n\\[2020.4.1追記\\]  \nサービス名を「ゾラサーチ」から「ブンゴウサーチ」に変更しました。\n\n[search.bungomail.com](http://search.bungomail.com/)* * *\n\nこれはなに？\n------\n\n青空文庫の作品を目安の読了時間で検索できるサービスです。 たとえばこんな感じで、「5分で読める芥川竜之介の短編」みたいに探すことができます。\n\n![f:id:o_tomomichi:20190330163010p:plain](https://cdn-ak.f.st-hatena.com/images/fotolife/o/o_tomomichi/20190330/20190330163010.png \"f:id:o_tomomichi:20190330163010p:plain\")\n\n[5分以内で読める芥川竜之介の短編作品 | ゾラサーチ](https://search.bungomail.com/authors/879/categories/flash/books)\n\nもちろん読書スピードは人によって激しく違うので、あくまで目安として参考にしてください。 （読了時間の算出基準などは[こちら](https://search.bungomail.com/about)に書いています）\n\nまた作品の文字数（これも目安ですが）も載せているので、慣れてきたらそこから自分の読了時間を大体予測できるかもしれません。\n\nアピールポイント\n--------\n\n*   デフォルトで人気の作品順に並ぶのでいい感じに探せる（※）\n*   本の書き出し部分もチラ見せしてくれる（スマホでは作品詳細画面のみ）\n*   けっこうサクサク動く（はず）\n\n※作品の人気度は、過去10年分の青空文庫アクセスランキングの累計を基に算出。\n\nなんで作ったの？\n--------\n\n青空文庫の公式サイトは一覧性を重視した作りになっていて、特定の本を探すには便利ですが、知らない本と出会うのはなかなか難しかったりします。 なのでそれを解決するサービスを作りたいと思ったのが開発の動機です。\n\n特に自分の場合だと、実際に読む前にその本の長さがけっこう気になります。 「今日は1日カフェにこもってじっくり長編を読むぞー」なのか、「寝る前に30分くらいでさくっと読める短編ないかなー」なのか。\n\nしかし現状の青空文庫では実際に作品を選ばないとどれくらいの長さなのかわからないので、なかなかこのニーズにマッチしません。 また青空文庫リーダー系のアプリもいくつか見ましたが、同様の機能を提供するものはなさそうです。なので作りました。\n\nほんとにそれだけ？\n---------\n\n鋭いですね。実は他にも背景があります。\n\n#### ブンゴウメールというのをやってまして\n\n青空文庫の作品を小分けにして毎日メールで配信してくれる、「ブンゴウメール」というサービスを運営しています。 （意外とおもしろいので、まだの方はぜひ登録してね）\n\n[bungomail.com](https://bungomail.com)\n\n最近忙しくて読書できていない方や、ふだんあまり文学を読まない方からも多く利用いただいています。 で、うれしいことに「ブンゴウメールをきっかけに読書の習慣ができて、自分でも本を読むようになった」という報告をいただいたりします（うれしい！）。\n\nというわけで、「ブンゴウメールで初めて夢野久作を読んで、他の作品も読んでみたくなった」みたいな方がいい感じに次の本を探せるサービスを作りたい、というのも制作の背景としてありました。（逆にブンゴウメールへの集客施策の一環という位置づけもあります）\n\nさらにちなみの裏話としては、ブンゴウメールのために青空文庫の全作品のテキストを解析して分割保存するということをしており、せっかくなのでこの大量に溜まったデータを何か活用できないかなーという背景もありました。\n\n※青空文庫は作品データをすべてGithubに公開してくれており、ブンゴウメール・ゾラサーチともそこからデータを取得して利用しています。クローリングなどによる青空文庫本体へのシステム負荷は一切ありませんので安心してお使いください。\n\n#### 青空文庫にもお返ししたい\n\nとってつけたように最後に書いてますが、実はこれもずっと考えていたことでして。\n\nご存知の方も多いと思いますが、青空文庫の作品はボランティアの方によってひとつひとつ入力されています。 青空文庫自体がもはや一種のインフラみたいな存在になっていますが、それが存在できているのは全然当たり前のことではないのです。\n\n自分も青空文庫の恩恵を多大に受けているので、何かお返しをしたいとは常々思ってまして。 その一環として、ブンゴウメールの有料版を作って収益の一部を青空文庫の活動支援に還元するということも始めました。\n\n[https://bungomail.com/pro](https://bungomail.com/pro)\n\nただ残念ながら金額的に大した貢献にはならないので（マネタイズむずかしい）、もっと自分が得意なところで何か貢献したいなと。 というわけで、Webエンジニアらしく青空文庫をもっと便利にするサービスを開発してみたという背景もありました。\n\nちなみに、青空文庫には現状専属のエンジニアがおらず、ボランティアベースで維持・改善が行われている状態です。 （それであの規模のシステムが稼働し続けているのは本当にすごい）\n\n有志による青空文庫を技術的に支える活動「aozorahack」というのもあるので、興味のある方はぜひ参加してみてください！ （自分はまだ何も貢献できてない。。）\n\n[aozorahack](https://aozorahack.org/)\n\n* * *\n\nまとめ\n---\n\nというわけで、個人的にはけっこう便利なサービスになったので満足しております。 何か新しい本読んでみようかなーというときにでもぜひお使いください。\n\n[search.bungomail.com](https://search.bungomail.com)\n\n引き続きブンゴウメールもよろしくね。\n\n[bungomail.com](https://bungomail.com)\n\nおしまい。","date":1554352449000,"image":"https://storage.googleapis.com/blog-notsobad/images/20190403115005.png","tag":["つくったもの","ゾラサーチ","ブンゴウメール","青空文庫"]}},"__N_SSG":true}