{"pageProps":{"entry":{"title":"独自ドメイン取るべきかどうか問題を判断できる（かもしれない）フローチャートを作りました","slug":"2019/04/09/130141","excerpt":"新しいWebサービスを作るときに、独自ドメイン取るべきかは毎回悩ましいところです。\n\nというわけで、そんなドメインどうするか問題を判断する助けになるかもしれない（たぶんならない）フローチャートを作りました。","content":"新しいWebサービスを作るときに、独自ドメイン取るべきかは毎回悩ましいところです。\n\nというわけで、そんなドメインどうするか問題を判断する助けになるかもしれない（たぶんならない）フローチャートを作りました。* * *\n\n前提\n--\n\n独自ドメインで始めた個人開発サービスの8割は1年後にドメイン切れを起こして死ぬという「個人開発の死の谷」があります。(適当です)\n\nなので個人的に、ほとんどの個人開発はサブドメインで始めるのがいいんじゃないかなーと思ってる派です。 この辺の話は以前に別の記事でも書きました。\n\n[blog.notsobad.jp](https://blog.notsobad.jp/entry/2018/07/30/110000)\n\nそんな人間が書いているので、かなりサブドメインを優遇したフローになっております。ご了承ください。\n\nというわけでフローチャートはこちらです\n-------------------\n\n![f:id:o_tomomichi:20190403121252p:plain](https://storage.googleapis.com/blog-notsobad/images/20190403121252.png \"f:id:o_tomomichi:20190403121252p:plain\")\n\n何か事情があるなら「独自ドメイン」OR「サブディレクトリ」、そうじゃないなら「サブドメイン」にしようね、という意志を感じるチャートになっております。\n\n以下、各項目を簡単に見てみましょう。\n\n* * *\n\n### 3年は絶対に運営を続ける\n\nまずそもそも論として、ずっと長く続けるサービスなら最初から独自ドメインではじめたほうがいいことが多いわけです。 ドメインの評価もちゃんと蓄積するし、メディアなどに古いドメインへのリンクが残るようなこともないし。\n\nというわけで、本気でしばらく注力する意気込みがあるなら、そりゃ独自ドメイン取りましょうよと。\n\nただ人の気持ちは移ろいやすいので、このサービスで天下取るぞと意気込んで独自ドメイン取っても、1年後には全然違う未来が待っていることも多いですよね（実話）。 全然誰も使っていないサービスに毎年ドメイン更新料を払い続けるのは、なかなか辛いものです。\n\nなので、個人的にサービス開始時のテンションはあんまり信用していません。\n\nたとえドメイン代払うと赤字でも、ライフワークとして取り組むくらいの意気込みがあるなら、独自ドメイン取りましょう。 でもそうじゃないなら、とりあえずサブドメインから始める選択肢もいいかもしれません（布教活動）。\n\n### サービス名が絶対に変わらない\n\nサービス名どんぴしゃで独自ドメインを取ってしまうと、サービス名を変えたくなったときに困ります。 名前変更に強いというのはサブドメインの地味な効用です。 （もちろん変えないにこしたことはないんですが。。）\n\nたとえば自分は最近、青空文庫の作品を検索できるサービスを作りました（もちろんサブドメイン）。\n\n[search.bungomail.com](https://search.bungomail.com/)\n\n語呂が気に入って「ゾラサーチ」という名前にしたんですが、「アオゾラサーチ」の方がわかりやすくていいかなーとか結構悩んだわけです。\n\nこのサービスではたぶん名前を変えることはないと思いますが、もしこれが「zorasearch.com」とかで独自ドメインを取っていたら、後から「アオゾラサーチ」に変えるとドメインと齟齬が起きてちょっとモニョります（個人の見解です）。\n\nしかしこれがサブドメイン「search.bungomail.com」だとどうでしょう。サービス名が「ゾラサーチ」だろうが「アオゾラサーチ」だろうが、ドメイン的には何も問題ありません。 （そもそもサブドメインがダサいと言われてしまうと身も蓋もないけど。。）\n\nいやいやそんな名前変えないでしょって気もするけど、サービス名しっくり来ない問題は意外とありまして。 自分もリリース後に名前を変えたいと思ったことは何回もあるし、独自ドメインなのが一因になって断念したこともあります（[THE TIMELINE](https://the-timeline.jp)、お前だよ！）\n\nまぁ名前変更はドメイン以外にも制約がありますが、少なくとも最初から制約を増やす必要はないので、しっくり来てないならとりあえずサブドメインから始めるのもよいですよ、と。\n\nこの場合、サービス名そのままじゃなくてちょっと抽象的な単語でサブドメインにするのがおすすめです。 「zorasearch.bungomail.com」だと結局サービス名変えられないからね。。\n\n### ドメイン芸がしたい\n\nサービスの名前や概念をきれいに表現できる独自ドメインを見つけてしまったとき。 いくらお金がかかろうが、SEO的に怒られようが、ドメイン芸人は目の前のチャンスを無視することができません（言い過ぎました）。\n\nドメイン芸がきれいに決まっているケースとしては、たとえばこういうやつですね。どっちもいいドメイン…！\n\n[www.fumu.in](https://www.fumu.in/)\n\n[hyou.show](https://hyou.show/)\n\nドメイン芸が狙えるのであれば、他の条件は無視せざるをえません。 独自ドメイン取りましょう。\n\n### アドセンスを貼りたい\n\n地味なんだけど意外とひっかかるところ。 アドセンスのルールが変わって、サイトごとに審査が必要になりましたね。 そして以下の記事にもある通り、ほぼ独自ドメインが必須なようです。\n\n[www.iscle.com](https://www.iscle.com/web-it/g-drive/adsense/site-level-tsuika.html)\n\nアドセンス収益がビジネスモデルに組み込まれているなら、残念ながらあまり選択の余地はありません。 最初から独自ドメインを取りましょう。\n\n### ミニサイトでドメイン強化したい\n\n最後にちょっとイレギュラーなケース。「サブディレクトリ」で新サービスを展開するパターンです。 こちらの記事が非常に参考になります。\n\n[note.mu](https://note.mu/catnose/n/n0246ada32871)\n\nメインサイトに対するミニサイト・ミニツールという位置づけで、サブディレクトリで別サービスを提供する方法ですね。\n\nメインサイトのSEOを強化できることが大きなメリットですが、各サービスが色々と密結合になりやすそうなのが弱点かなーと思います（あんまりやったことないので知らんけど）。 サイトの構造的に許容できるケースであれば、ぜひ検討してみたいところです。\n\n* * *\n\nまとめ\n---\n\nまぁ色々書きましたが、99%のユーザーはドメインなんて気にしないので、好きなもの使うのが一番ですよね（あれ）。 とはいえドメイン切れの悲劇は少しでも減ってほしいので、サブドメイン教の人が増えてくれれば幸いです。\n\nおしまい。","date":1554782501000,"image":"https://storage.googleapis.com/blog-notsobad/images/20190403121252.png","tag":["細かすぎて伝わらない","意識低い","個人開発論"]}},"__N_SSG":true}