{"pageProps":{"entry":{"title":"失敗から学ぶ、Webサービスのための悪くないネーミング論","slug":"2019/10/10/174738","excerpt":"![f:id:o_tomomichi:20191010173353j:plain](https://storage.googleapis.com/blog-notsobad/images/20191010173353.jpg \"f:id:o_tomomichi:20191010173353j:plain\") （[布団でぬくぬくのにゃんご画像](https://www.pakutaso.com/20171154312post-13935.html)は本文と一切関係がありません）\n\n* * *\n\nWebサービスのネーミングはなかなか体系的に学んだりする機会もなく、センスに頼るところが大きいものです。\n\nそこで過去の失敗事例からネーミングのアンチパターンを学び、ちょっとしたネーミングの方法論のようなものを整理してみた記事がこちらになります。 例によって意識低めの方法論となっておりますので、あらかじめご了承ください。","content":"![f:id:o_tomomichi:20191010173353j:plain](https://storage.googleapis.com/blog-notsobad/images/20191010173353.jpg \"f:id:o_tomomichi:20191010173353j:plain\") （[布団でぬくぬくのにゃんご画像](https://www.pakutaso.com/20171154312post-13935.html)は本文と一切関係がありません）\n\n* * *\n\nWebサービスのネーミングはなかなか体系的に学んだりする機会もなく、センスに頼るところが大きいものです。\n\nそこで過去の失敗事例からネーミングのアンチパターンを学び、ちょっとしたネーミングの方法論のようなものを整理してみた記事がこちらになります。 例によって意識低めの方法論となっておりますので、あらかじめご了承ください。* * *\n\n### そもそもネーミングってそんなに大事？\n\nすごくそもそもなんですが、ネーミングなんて好きなのでいいじゃんという考えもあります。 これは完全にその通りで、「絶対これ！」という名前を思いついたら、誰に何を言われようがそれを使うのが一番ですよね。\n\nとはいえ実際にはそこまでドンピシャの名前を思いつかず、悩みながらネーミングを考えることも多かったりします。 そんなときにわざわざデメリットのあるネーミングを選ぶ必要はないので、最低限の原則を守ってネーミングで損をしないようにする＝悪くないネーミングを考えてみようというのがこの記事の目的です。\n\n💩【実録】これが損するネーミングだ\n------------------\n\nじゃあネーミングで損するって何だよって話なんですが、ネーミング地雷をいくつも踏み抜いた失敗ネーミングの宝石箱のようなサービスがあるので、これを具体例として見てみましょう。\n\nトーナメント表作成サービス「THE TOURNAMENT」です。\n\n[the-tournament.jp](https://the-tournament.jp/)\n\nWeb上で簡単にきれいなトーナメント表が作成できます。 何かの事情でトーナメント戦やるときはぜひお試しください。\n\nというわけで以下、このネーミングで損したところです。\n\n### ❌ググらビリティが低すぎる\n\n一番はやっぱりこれ。ただの一般名詞に「THE」をつけても全然ユニークになりません。 サービス名「THE TOURNAMENT」でググって検索上位に出るまで、相当時間がかかりました（1年くらい？）。\n\nもちろんサービス名検索がメイン流入になることってむしろ珍しいと思うので、気にしないっていう選択肢もあります。 でも意外と人から聞いたとか、前に見たあのサービス何だっけとか、サービス名でググるケースもあったりしますよね。\n\n致命的な影響はなくても取りこぼしは減らしたいし、そもそも自分のサービスが名前でググって出てこないのはとても悲しいです。\n\n### ❌まったく同じ名前の映画があった\n\n一般名詞の壁を越えて検索で出てくるようになっても、今度は完全に同名の映画が立ちはだかってきました。\n\n[www.imdb.com](https://www.imdb.com/title/tt0471041/)\n\n同じ名前がすでに使われていないか事前にチェックするのは基本中の基本ですね。とても反省しています。\n\nちなみに気になる映画の内容は\n\n> 世界各国から暗殺者たちが集結し、最後の一人になるまで殺し合う殺人トーナメントで、はからずも参加者となってしまった神父の姿を活写するアクション。\n\nおもしろそうかよ。\n\n### ❌名前にスペースが入ると色々めんどくさい\n\n単語を2つ組み合わせてサービス名にするのはよくある手法ですが、間にスペースやハイフンが入るとユニークな単語として認識されにくくなりがち。\n\nスペースなしで単語をくっつける「合成語」にできたら、この問題は避けれるんじゃないかと思いますよ（後述）。\n\n### ❌長い英単語はむずかしい\n\nトーナメントだとこういう単語なんでしょうがないんですけど、アルファベットの長い単語は思ってる以上に拒否反応があります。 開発者はずっと見てるので読めて当然と思っちゃうんですが、ふつうはサービス名なんてそんなにじっくり見ないので、ぱっと見て読めないと読んでもらえないんですよね。。\n\n後からいざググろうとしてもスペルがわからなかったり間違えたりして、検索で辿り着かない可能性も増えてしまいます。\n\n何よりトーナメントの場合、初期の開発でエラーが出た原因の3割くらいはtournamentのスペルミスでした（恥ずかしい）。\n\n### ❌そもそも英語だと「トーナメント」の意味が違う\n\nどうも違うようです。\n\n[www.eevocablog.com](https://www.eevocablog.com/tournament/)\n\nまぁこのままで海外展開できないほど違うわけではなかったのでよかったですが、こういうことは稀によくあるので最初にちゃんと調べたほうがいいですね。本当に（反省）\n\n* * *\n\n📋「カタカナ2語の合成語」というご提案\n--------------------\n\nというわけで、こういう失敗を何回も繰り返して、その反省から個人的に最近よく使うメソッドが「カタカナ2語の合成語」です。 オーソドックスすぎてわざわざ言うのも恥ずかしいですけど。\n\nたとえば拙作では、「ブンゴウメール」などがこれに該当します。\n\n[bungomail.com](https://bungomail.com/)\n\n*   カタカナネーミングなので、読み方が誰でもわかる\n*   ユニークな単語として認識されやすい\n\nという感じで、前述の失敗はかなり避けやすくなっているんじゃないかと。\n\nこの方法論自体はベーシックなものですが、もちろんこれでかっこいいネーミングだって作れます。\n\n[sauna-ikitai.com](https://sauna-ikitai.com/)\n\nカタカナネーミングの超かっこいい事例。間違える余地なし！わかりやすい！ もちろん圧倒的にかっこいいデザインも影響してますが、ネーミング単体でもすごくよいですね。\n\nとはいえサービスの雰囲気を考えてどうしてもアルファベット表記にしたいという場合は、\n\n*   長い名前を避ける\n*   カタカナで読み方を併記する\n*   ローマ字読みできない名前を避ける\n\nあたりを抑えておけば、損する機会はかなり減らせるんじゃないかと。\n\n* * *\n\n🏆殿堂入り神ネーミング事例集\n---------------\n\n以上の方法で、少なくとも「損をしない」＝「悪くない」ネーミングになるはず。 しかしこれを守った上でさらにプラスアルファの要素が入ると、神ネーミングが生まれると言われています。\n\n最後にそんなお気に入りの事例を少しだけご紹介。どれもとてもいいネーミングです。 毎回こうしたプラスアルファを使えるわけじゃないですが、チャンスがあれば狙ってみたいですね。\n\n#### ハッカドール\n\n[hackadoll.com](https://hackadoll.com/)\n\n残念ながら最近サービス終了してしまいましたが、個人的にWebサービスのネーミング歴代1位に君臨し続ける神ネーミングサービスです。\n\nこういうのをわざわざ解説するのも恥ずかしいですが、「はかどる」をベースに「ハック」と「ドール」と掛けた多重ミーニングがきれいに決まっています。\n\nいやよく考えたら「ハック」はともかく「ドール」って何だよって感じですが、美少女キャラクターをメインビジュアルに置くことで何となく「ドール」のイメージとも合致して完璧なネーミングになっています。語呂も最高。\n\n#### トリオキニ\n\n[triokini.com](https://triokini.com/)\n\n「取り置き」＋「お気に」で「トリオキニ」。シンプルベストなネーミングです。 単語を重ねるのはポピュラーな方法ですが、トリオキニのように2文字以上重ねられるとやったぜ感が出ますね（何の？）。\n\nちなみに作者の[さちえさん](https://twitter.com/curry_solodev)の最新作は、「あなたは森で、私はタタラ場で生きるためのWebサービス『モリタタ』」。このネーミングセンス、やはり天才か。。。\n\n[https://twitter.com/curry\\_solodev/status/1108022492377956352](https://twitter.com/curry_solodev/status/1108022492377956352)\n\n#### IMAKITA\n\n[qhapaq.hatenablog.com](http://qhapaq.hatenablog.com/entry/2018/12/09/234447)\n\n最後は「長文を三行くらいでまとめてくれるエンジン『IMAKITA』」です。 読みやすさ・ググラビリティを満たした上で、サービス内容との連想にひねりが効いたグッドネーミング！ 個人的にこういうセンスがすごく好き。\n\nローマ字表記だけど全部母音で終わってるので、日本語話者が読み方で迷いにくいのも地味なポイントです。\n\n* * *\n\nまとめ\n---\n\nという感じで色々書いたけど、ネーミングより大事なことはたくさんあるので、あんまり気にしすぎずにサービス作りをがんばりましょうという感じですね。\n\nそしてこれ以外の神ネーミングをご存知の方はぜひコメントで教えてください。\n\nおしまい。","date":1570697258000,"image":"https://storage.googleapis.com/blog-notsobad/images/20191010173353.jpg","tag":["意識低い","個人開発論","ポエム"]}},"__N_SSG":true}